Revit 2026 API

# DocumentCreatingEventArgs Class

---

The event arguments used by the DocumentCreating event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.DB.EventsDocumentCreatingEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DocumentCreatingEventArgs : RevitAPIPreEventArgs
```
```vb
Public Class DocumentCreatingEventArgs
	Inherits RevitAPIPreEventArgs
```
```cpp
public ref class DocumentCreatingEventArgs : public RevitAPIPreEventArgs
```
```fsharp
type DocumentCreatingEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
```

The DocumentCreatingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | DocumentType | Type of the document which is about to be created, e.g. Project or Template. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Template | The template file path to be used for creating the new document. |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace